Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/СессияЭлектронногоРесурсаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СессияЭлектронногоРесурсаСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаВопросыСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПовторноеПрохождениеЭлектронныхРесурсовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовВопросовСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяСессия</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСессии</name>
    <type>
      <types>EnumRef.ТипыСессийЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТекстовые</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеТекстовые</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Enums/ТипыСессийЭлектронныхРесурсовСУЗ/ТипыСессийЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСессийЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>course</name>
  </enumValues>
  <enumValues>
    <name>staticPage</name>
  </enumValues>
  <enumValues>
    <name>SCOPage</name>
  </enumValues>
  <enumValues>
    <name>quiz</name>
  </enumValues>
  <enumValues>
    <name>answerQuestion</name>
  </enumValues>
  <enumValues>
    <name>cabinetLearning</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/СессияЭлектронногоРесурсаСУЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция КорневаяСессияПрохожденияЭлектронногоКурса(Знач Пользователь, Знач ПрохождениеОбучения, Знач ЭлектронныйРесурс, Знач Задание, Знач ТипСессии = Неопределено) Экспорт
	
	// Примечание: не следует искать корневую сессию по таблицам движений,
	// так как при отмене обучения движения будут удалены и есть риск
	// создать дубль сессии изучения курса, если они не успеют восстановиться.
	
	Если ЗначениеЗаполнено(ПрохождениеОбучения)
		И НЕ ЗначениеЗаполнено(Задание) Тогда
		
		ВызватьИсключение НСтр("ru = 'Задание прохождения обучения не задано'");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		ПрохождениеОбучения = Метаданные.ОпределяемыеТипы.ПрохождениеЭлектронногоОбучения.Тип.ПривестиЗначение(ПрохождениеОбучения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Задание) Тогда
		Задание = Метаданные.ОпределяемыеТипы.ЗаданиеЭлектронногоОбучения.Тип.ПривестиЗначение(Задание);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка КАК Сессия,
		|	СессияЭлектронногоРесурсаСУЗ.Дата КАК Дата
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И СессияЭлектронногоРесурсаСУЗ.Пользователь = &Пользователь
		|	И &ОтборТипСессииCourse
		|	И &ОтборПрохожденияОбучения
		|	И &ОтборЗадания
		|	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СессияЭлектронногоРесурсаСУЗ.Ссылка,
		|	СессияЭлектронногоРесурсаСУЗ.Дата
		|ИЗ
		|	Документ.СессияЭлектронногоРесурсаСУЗ КАК СессияЭлектронногоРесурсаСУЗ
		|ГДЕ
		|	СессияЭлектронногоРесурсаСУЗ.ЭлектронныйРесурс = &ЭлектронныйРесурс
		|	И СессияЭлектронногоРесурсаСУЗ.Пользователь = &Пользователь
		|	И &ОтборТипСессииCabinetLearning
		|	И &ОтборПрохожденияОбучения
		|	И &ОтборЗадания
		|	
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";

	Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПрохожденияОбучения", "СессияЭлектронногоРесурсаСУЗ.ПрохождениеОбучения = &ПрохождениеОбучения");
		Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПрохожденияОбучения", "ИСТИНА");		
	КонецЕсли;
	
	Если ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.course Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCourse", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.course)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCabinetLearning", "ЛОЖЬ");		
	ИначеЕсли ТипСессии = Перечисления.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCourse", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCabinetLearning", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCourse", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.course)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипСессииCabinetLearning", "СессияЭлектронногоРесурсаСУЗ.ТипСессии = ЗНАЧЕНИЕ(Перечисление.ТипыСессийЭлектронныхРесурсовСУЗ.cabinetLearning)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задание) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗадания", "СессияЭлектронногоРесурсаСУЗ.Задание = &Задание");
		Запрос.УстановитьПараметр("Задание", Задание);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗадания", "ИСТИНА");		
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Сессия;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
